In [2]:
#2021.06.02. WED
#Hankyeong

#00. 패키지 호출
import numpy as np
import pandas as pd 
import seaborn as sns

#01. seaborn 패키지의 Titanic 데이터셋을 불러오시오. (HINT: sns.load_dataset('titanic'))
titanic = sns.load_dataset("titanic")
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [5]:
#(1) 타이타닉호의 승객에 대해 나이와 성별에 의한 카테고리 열인 category1 열을 만드시오. category1 카테고리는 다음과 같이 정의됨
#    20살이 넘으면 성별을 그대로 사용한다.
#    20살 미만이면 성별에 관계없이 “child”라고 한다.
titanic["category_1"] = titanic.apply(lambda x: x["sex"] if x["age"] > 20 else "child", axis=1)
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category_1
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,male
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,female
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,female
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,female
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,male
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,male
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,child
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,child
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,male
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,male

In [14]:
#(2) 타이타닉호의 승객 중 나이를 명시하지 않은 고객은 나이를 명시한 고객의 평균 나이 값이 되도록 titanic 데이터프레임을 고치시오.
titanic_age_mean = np.round(titanic["age"].mean(),0)
titanic["age"] = titanic["age"].fillna(titanic_age_mean).astype(int)
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category_1
0,0,3,male,22,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,male
1,1,1,female,38,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,female
2,1,3,female,26,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,female
3,1,1,female,35,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,female
4,0,3,male,35,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,male
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,male
887,1,1,female,19,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,child
888,0,3,female,30,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,child
889,1,1,male,26,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,male
890,0,3,male,32,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,male

In [20]:
#(3) 성별, 선실(class)별, 출발지(embark_town)별 생존율을 구하시오.
titanic.groupby(["sex","class","embark_town"]).mean()["survived"]

sex     class   embark_town
female  First   Cherbourg      0.976744
                Queenstown     1.000000
                Southampton    0.958333
        Second  Cherbourg      1.000000
                Queenstown     1.000000
                Southampton    0.910448
        Third   Cherbourg      0.652174
                Queenstown     0.727273
                Southampton    0.375000
male    First   Cherbourg      0.404762
                Queenstown     0.000000
                Southampton    0.354430
        Second  Cherbourg      0.200000
                Queenstown     0.000000
                Southampton    0.154639
        Third   Cherbourg      0.232558
                Queenstown     0.076923
                Southampton    0.128302
Name: survived, dtype: float64

In [3]:
titanic.pivot_table(values="survived",index=["sex","class"],columns="embark_town",margins=True)

embark_town    Cherbourg  Queenstown  Southampton       All
sex    class
female First    0.976744    1.000000     0.958333  0.967391
       Second   1.000000    1.000000     0.910448  0.921053
       Third    0.652174    0.727273     0.375000  0.500000
male   First    0.404762    0.000000     0.354430  0.368852
       Second   0.200000    0.000000     0.154639  0.157407
       Third    0.232558    0.076923     0.128302  0.135447
All             0.553571    0.389610     0.336957  0.382452

In [26]:
#(4) 타이타닉호 승객을 ‘미성년자’, ‘청년’, ‘중년’, ‘장년’, ‘노년’ 나이 그룹으로 나누고, 각 그룹별 생존율을 구하시오.
#    bins = [1, 20, 30, 50, 70, 100]
#    labels = ["미성년자", "청년", "중년", "장년", "노년"]
titanic["category_2"] = pd.cut(titanic["age"],bins = [1, 20, 30, 50, 70, 100],labels=["미성년자","청년","중년","장년","노년"])
titanic.groupby("category_2").mean()["survived"].sort_index()

category_2
미성년자    0.421687
청년      0.333333
중년      0.426778
장년      0.350000
노년      0.250000
Name: survived, dtype: float64

In [5]:
#(5) qcut 명령으로 세 개의 나이 그룹을 만들고, 나이 그룹별 남녀 성비와 생존율을 구하시오.
titanic["category_3"] = pd.qcut(titanic["age"],3,labels=["child","young","old"])
titanic.groupby("category_3").mean()["survived"]

category_3
child    0.418699
young    0.400862
old      0.398305
Name: survived, dtype: float64

In [6]:
#02. seaborn 패키지의 mpg(Mile per Gallon) 데이터셋을 불러오시오. (HINT: sns.load_dataset('mpg'))
#(1) 배기량(displacement) 대비 마력(horsepower) 열(hp_per_cc)을 추가하시오.
mpg = sns.load_dataset("mpg")
mpg["hp_per_cc"] = mpg["horsepower"] / mpg["displacement"]
mpg

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name,hp_per_cc
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu,0.423453
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320,0.471429
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite,0.471698
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst,0.493421
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino,0.463576
...,...,...,...,...,...,...,...,...,...,...
393,27.0,4,140.0,86.0,2790,15.6,82,usa,ford mustang gl,0.614286
394,44.0,4,97.0,52.0,2130,24.6,82,europe,vw pickup,0.536082
395,32.0,4,135.0,84.0,2295,11.6,82,usa,dodge rampage,0.622222
396,28.0,4,120.0,79.0,2625,18.6,82,usa,ford ranger,0.658333
397,31.0,4,119.0,82.0,2720,19.4,82,usa,chevy s-10,0.689076

In [7]:
#(2) name열로부터 manufacturer(제조사)와 모델을 추출하여, 새로운 열 manufacturer와 model을 추가하고, name 열은 삭제하시오.
#step1. manufacturer(제조사) 시리즈 추가
mpg["manufacturer"] = mpg["name"].str.split().str[0]
mpg

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name,hp_per_cc,manufacturer
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu,0.423453,chevrolet
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320,0.471429,buick
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite,0.471698,plymouth
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst,0.493421,amc
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino,0.463576,ford
...,...,...,...,...,...,...,...,...,...,...,...
393,27.0,4,140.0,86.0,2790,15.6,82,usa,ford mustang gl,0.614286,ford
394,44.0,4,97.0,52.0,2130,24.6,82,europe,vw pickup,0.536082,vw
395,32.0,4,135.0,84.0,2295,11.6,82,usa,dodge rampage,0.622222,dodge
396,28.0,4,120.0,79.0,2625,18.6,82,usa,ford ranger,0.658333,ford
397,31.0,4,119.0,82.0,2720,19.4,82,usa,chevy s-10,0.689076,chevy

In [8]:
#step2. model 시리즈 추가하고, for문을 돌려 model_name_series 만들기.
model_1 = mpg["name"].str.split().str[1:3]
model_2 = mpg["name"].str.split().str[1:2]
model_name_list = []
for i, s in enumerate(model_1) :
    if len(model_1[i]) == 2    :
        model_name_list.append(" ".join(model_1[i]))
    else                     :
        model_name_list.append(" ".join(model_2[i]))
model_name_series=pd.Series(model_name_list)
model_name_series.name = "model"
model_name_series.head(5)

0    chevelle malibu
1        skylark 320
2          satellite
3          rebel sst
4             torino
Name: model, dtype: object

In [9]:
#step3. mpg데이터프레임과 model_name_series 결합하기.
mpg = pd.concat([mpg,model_name_series],axis=1)
mpg

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name,hp_per_cc,manufacturer,model
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu,0.423453,chevrolet,chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320,0.471429,buick,skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite,0.471698,plymouth,satellite
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst,0.493421,amc,rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino,0.463576,ford,torino
...,...,...,...,...,...,...,...,...,...,...,...,...
393,27.0,4,140.0,86.0,2790,15.6,82,usa,ford mustang gl,0.614286,ford,mustang gl
394,44.0,4,97.0,52.0,2130,24.6,82,europe,vw pickup,0.536082,vw,pickup
395,32.0,4,135.0,84.0,2295,11.6,82,usa,dodge rampage,0.622222,dodge,rampage
396,28.0,4,120.0,79.0,2625,18.6,82,usa,ford ranger,0.658333,ford,ranger
397,31.0,4,119.0,82.0,2720,19.4,82,usa,chevy s-10,0.689076,chevy,s-10

In [10]:
#step4. name 시리즈 지우기
del mpg["name"]
mpg

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,hp_per_cc,manufacturer,model
0,18.0,8,307.0,130.0,3504,12.0,70,usa,0.423453,chevrolet,chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,0.471429,buick,skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,0.471698,plymouth,satellite
3,16.0,8,304.0,150.0,3433,12.0,70,usa,0.493421,amc,rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,usa,0.463576,ford,torino
...,...,...,...,...,...,...,...,...,...,...,...
393,27.0,4,140.0,86.0,2790,15.6,82,usa,0.614286,ford,mustang gl
394,44.0,4,97.0,52.0,2130,24.6,82,europe,0.536082,vw,pickup
395,32.0,4,135.0,84.0,2295,11.6,82,usa,0.622222,dodge,rampage
396,28.0,4,120.0,79.0,2625,18.6,82,usa,0.658333,ford,ranger
397,31.0,4,119.0,82.0,2720,19.4,82,usa,0.689076,chevy,s-10

In [8]:
#(3) 엔진의 실린더(cylinders) 갯수별 연비(mpg)의 평균을 구하시오.
mpg.groupby("cylinders").mean()["mpg"]

cylinders
3    20.550000
4    29.286765
5    27.366667
6    19.985714
8    14.963107
Name: mpg, dtype: float64

In [11]:
#(4) 생산지(origin)별 배기량 대비 마력(hp_per_cc)의 평균을 구하시오.
mpg.groupby("origin").mean()["hp_per_cc"]

origin
europe    0.740005
japan     0.789485
usa       0.512063
Name: hp_per_cc, dtype: float64

In [10]:
#(5) 모델이 5개 이상인 제조사에 대하여 연비(mpg)의 평균이 가장 좋은 제조사 Top 5를 구하시오.
#step1. model 변수의 개수를 카운트한 model_count 시리즈 생성
model_count = mpg.groupby("manufacturer").count()["model"]
model_count.name = "model_count"
model_count.sort_values(ascending=False)

manufacturer
ford             51
chevrolet        43
plymouth         31
amc              28
dodge            28
toyota           25
datsun           23
buick            17
pontiac          16
volkswagen       15
honda            13
mercury          11
oldsmobile       10
mazda            10
fiat              8
peugeot           8
audi              7
volvo             6
vw                6
chrysler          6
renault           5
saab              4
opel              4
subaru            4
chevy             3
maxda             2
bmw               2
cadillac          2
mercedes-benz     2
chevroelt         1
capri             1
toyouta           1
triumph           1
vokswagen         1
hi                1
nissan            1
mercedes          1
Name: model_count, dtype: int64

In [11]:
#step2. merge()함수로 model_count시리즈와 mpg데이터프레임 결합하기. 
mpg_merge = pd.merge(mpg,model_count,on="manufacturer")
mpg_merge

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,hp_per_cc,manufacturer,model,model_count
0,18.0,8,307.0,130.0,3504,12.0,70,usa,2.361538,chevrolet,chevellemalibu,43
1,14.0,8,454.0,220.0,4354,9.0,70,usa,2.063636,chevrolet,impala,43
2,15.0,8,400.0,150.0,3761,9.5,70,usa,2.666667,chevrolet,montecarlo,43
3,28.0,4,140.0,90.0,2264,15.5,71,usa,1.555556,chevrolet,vega2300,43
4,17.0,6,250.0,100.0,3329,15.5,71,usa,2.500000,chevrolet,chevellemalibu,43
...,...,...,...,...,...,...,...,...,...,...,...,...
393,23.0,8,350.0,125.0,3900,17.4,79,usa,2.800000,cadillac,eldorado,2
394,25.4,5,183.0,77.0,3530,20.1,79,europe,2.376623,mercedes,benz300d,1
395,29.8,4,89.0,62.0,1845,15.3,80,europe,1.435484,vokswagen,rabbit,1
396,35.0,4,122.0,88.0,2500,15.1,80,europe,1.386364,triumph,tr7coupe,1
397,36.0,4,120.0,88.0,2160,14.5,82,japan,1.363636,nissan,stanzaxe,1

In [12]:
#step3. mpg_merge데이터프레임에서 model_count변수(시리즈)가 5이상인 행을 추출하고, 
#       groupby()와 계산 함수를 통해 summarise한 다음, 
#       sort_values()하고 head()를 통해 상위 5개 추출 
mpg_merge[mpg_merge["model_count"]>=5].groupby("manufacturer").mean()["mpg"].sort_values(ascending=False).head(5)

manufacturer
vw         39.016667
honda      33.761538
renault    32.880000
datsun     31.113043
mazda      30.860000
Name: mpg, dtype: float64